// 配置文件
var config = {
    baiduOcr: {
        ak: "EB8d7XgH60MlGDqniYM28kmj",
        sk: "XvPh1hglX0c2LGqlPdlHGGyk4IdPkWlc"
    },
    clickConfig: {
        "1096-2560": {
            "我的": [
                {
                    color: "#ffffff",
                    points: [[0,12,"#ffffff"],[0,25,"#ffffff"],[-2,32,"#ffffff"],[36,29,"#e32416"],[35,13,"#e32416"],[32,0,"#e32416"],[55,24,"#ffffff"],[78,23,"#ffffff"]],
                    options: {
                        region: [922, 105, 1069-922, 182-105]
                    }
                },
                {
                    color: "#ffffff",
                    points: [[37, 21, "#e32416"], [43, 21, "#ffffff"], [54, 17, "#ffffff"], [67, 16, "#ffffff"], [80, 21, "#ffffff"], [64, 37, "#e32416"], [66, -1, "#ffffff"], [35, -3, "#e32416"]],
                    options: {
                        region: [922, 105, 1069, 182]
                    }
                }
            ],
            "学习积分": [
                {
                    color: "#f32d33",
                    points: [[3, 13, "#ffffff"], [7, 22, "#fa9b9d"], [6, 32, "#ffffff"], [6, 83, "#fa494b"], [-62, 145, "#687078"], [65, 164, "#687078"], [0, 157, "#687078"], [14, 149, "#687078"]],
                    options: {
                        region: [88, 942, 265, 1156]
                    }
                }
            ],
            "去": [
                {
                    color: "#fdf7ef",
                    points: [[24, 16, "#ba9e83"], [25, 26, "#ba9e83"], [11, 40, "#ba9e83"], [35, 39, "#ba9e83"], [37, 26, "#ba9e83"], [32, 15, "#ba9e83"], [24, 10, "#ba9e83"], [12, 26, "#ba9e83"], [30, 22, "#fdf7ef"]],
                    options: {
                        region: [867, 200, 1051-867, 1532-200]
                    }
                }
            ],
            "播报":[
                {
                    color:"#e32416",points:[[24,1,"#e32416"],[32,2,"#e32416"],[38,2,"#ffffff"],[54,3,"#e32416"],[71,-1,"#e32416"],[107,0,"#e32416"],[125,1,"#ffffff"]],
                    options: {
                        region: [867, 200, 1051-867, 1532-200]
                    }
                }
            ]
        }
    }
}

module.exports = config;